{"home":{"content":"# Lecture 0: Intros and Git\n---\n\nWelcome to Lecture 0 @GA. Here's a brief class breakdown.\n\n### Learning Objectives\n---\n\n1. Understand how HTTP, or the HyperText Transfer Protocol, works.\n2. Learn the significance of Git and why GitHub is relevant to our interests\n3. Learn the basic structure of a simple HTML page.\n\n\n### Rundown\n---\n\n#### [Setting up your Environment](#setting-up-your-environment)\n\n#### [Guts of an HTTP Request](#guts-of-an-http-request)\n\n#### [Deploying to the internets](#deploying-to-the-internets)\n\n#### [Basic HTML structure](#basic-html-structure)\n\n\n","idx":0},"title":{"content":"Lecture 0: Intros and Git","idx":1},"desc":{"content":"A gentle introduction to HTTP, Git, GitHub, and HTML","idx":2},"setting-up-your-environment":{"content":"# Setting up your Environment\n---\n\nWe will first set up the tools and resources we need to succeed in class. Then, we will set up tools and resources needed to write code.\n\n### Setting up your classroom environment\n---\n\n**FIRST**, please take a moment to fill in your **[student survey](https://mobilega.typeform.com/to/DbXlOu?course_name=front-end-web-development&campus=new-york-city&start_date=6-29-2016&github=yes&location=us&core_id=20908)**.\n\n**SECOND**, have you set up your **[Slack](https://fewd629.slack.com/messages)** profile yet? If not, please do so now. (We sent you an invite, if you did not receive it, please flag down Taq or Zack now).\n\n**THIRD**, please set up a **[GitHub](https://www.github.com)** account. **Make sure you also verify your email** after setting up your account.\n\n**FINALLY**, I have developed a suite of tools that we will use in class to make our lives easier.\n\n##### [Autosync](http://autosync.io/#/course/Taq/0)\nLive class notes. For the duration of the class, all code written on my machine will be available to you in _real time_ via [Autosync](http://autosync.io/#/course/Taq/0).\n\n##### [GitBot](http://gitbot.co/#home)\nWe will use [GitBot](http://gitbot.co/#home) to deploy our webpages to the internets. You will need this in class, for homework, and generally in life.\n\n##### [Samantha](http://fewd.us/samantha/)\nSamantha is an online coding environment. We will learn javascript in [Samantha](http://fewd.us/samantha/) + it is super useful for doing quick experiments / during office hours. \n\n...There are more, but for now, these should suffice. Check out some of my writings on tools and such on my [Medium page](https://medium.com/@the_taqquikarim/).\n\n### Setting up your code environment\n---\n\nBefore we can begin our exercises in wizardry, we must download and install a few relevant programs.\n\nThese programs are going to help us write code, transfer code to servers, and view the results of our code in the browser.\n\n#### Sublime Text\n\n[Sublime Text](http://www.sublimetext.com/3) &mdash; code editor &mdash; you'll be writing code here. This is a free tool, but they will ask you to donate every few saves. However, you can use the program for free as long as you'd like.\n\n#### Chrome\n[Chrome](https://www.google.com/chrome/browser/desktop/index.html) &mdash; web browser &mdash; you'll use this to view your code assignments. So free it hurts.","idx":3},"guts-of-an-http-request":{"content":"# Guts of an HTTP Request\n---\n\n**QUESTION**: what happens when you type in [http://www.google.com](http://www.google.com) into your URL bar?\n\n#### As it turns out, a whole lot.\n\n1. Chrome has no idea what [http://www.google.com](http://www.google.com) actually means, so first, it looks up the **IP Address** for Google.\n2. **DNS**, or **Domain Name System**, is a phone book containing IP Addresses for all the websites that exist on the internet.\n3. Chrome then sends an **HTTP Request** to the IP address associated with Google. An HTTP Request is essentially a text message asking Google for data.\n4. Google's **server** will issues a server **Response** back to your browser. This response is parsed by Chrome (ie: should Chrome display this response data? download it? etc)\n5. **???**\n6. Profit.\n\n#### Ok great, why do we care?\n\nThere are a few key insights to take away here.\n\nFirst and foremost, the main communication mechanism for the internet &mdash; you know, that thing that rules our lives &mdash; is **text**. Literally just **letters and words and numbers and characters**.\n\nThe other main point to take away here is this: the text that is transferred is written in a highly specific manner. It follows a very strict set of rules that can be parsed and understood by the server and the browser. In other words, this text follows a **specific set of grammatical rules**.\n\nThis set of grammar is what determines a **language**. In other words, the text being passed back and forth is a specific language (**HTML**, as it turns out). The browser and server understand this language. If **we** were to learn it as well, we would be able to command the browser to do whatever we want (ie: we would be able to create webpage layouts).\n\n\n\n\n","idx":4},"deploying-to-the-internets":{"content":"# Deploying to the internets\n---\n","idx":5},"basic-html-structure":{"content":"# Basic HTML structure\n---\n","idx":6},"__list__":["home","title","desc","setting-up-your-environment","guts-of-an-http-request","deploying-to-the-internets","basic-html-structure"]}